app/views/users/index.html.erb

							<% if current_user.following?(user) %>
								<%= form_for(current_user.relationships.find_by(follow_id: user.id), html: { method: :delete }) do |f| %>
---
SELECT  "relationships".* FROM "relationships" WHERE "relationships"."user_id" = ? AND "relationships"."follow_id" = ? LIMIT ?  [["user_id", 2], ["follow_id", 1], ["LIMIT", 1]]